{
  "MENU": {
    "HOME": "Главная",
    "INSTALLATION": "Монтаж",
    "OPERATORS": "Операторы",    
    "COMPANIES": "Компании",
    "TEAM": "Команда"
  },
  "OPERATOR": {
    "PARAMETER": {
      "TITLE": "Параметры",
      "NAME": "Название",
      "TYPE": "Тип",
      "ATTRIBUTE": "Аттрибут",
      "DESCRIPTION": "Описание"
    },
    "ADDITIONAL_RESOURCES": {
      "TITLE": "Дополнительные Источники",
      "SOURCE": "Исходный Код",
      "SPECS": "Спецификации"
    },
    "EXAMPLES": {
      "TITLE": "Примеры"
    },
    "RELATED_OPERATORS": {
      "TITLE": "Смотрите также"
    },
    "WALKTHROUGH": {
      "TITLE": "Описание"
    },
    "NO_TRANSLATION": "Перевод не завершен. Смотрите описание на английском языке"
  },
  "HOME": {
    "TITLE": "Библиотека реактивных расширений для JavaScript",
    "GETSTARTED": "Начать",
    "DESCRIPTION": "RxJS - библиотека для реактивного программирования с использованием Observables, упростить составление асинхронного или обратного кода. Этот проект является переписью Reactive-Extensions/RxJS с лучшей производительностью, улучшенная модульность, лучшие отлаживаемые стеки вызовов, сохраняя в основном обратную совместимость, с некоторыми нарушениями, которые уменьшают поверхность API",
    "INSTALL": {
      "TITLE": "Установите его",
      "DESCRIPTION": "Найдите информацию о том, как установить RxJs из разных источников из <i>npm </i>to<i> CDN</i>"
    },
    "LEARN": {
      "TITLE": "Узнать его",
      "DESCRIPTION": "Прочтите полную документацию по <i>Observables</i>, <i>Observer</i>, <i>Subject</i>, etc. Кроме того, просмотр живых примеров вместе с документацией с диаграммами, которые помогут вам лучше понять в действии"
    }
  },
  "INSTALLATION": {
    "TITLE": "Инструкция по установке",
    "VIA": "с помощью",
    "INTRO": "Вот несколько способов установки RxJs",    
    "IMPORT": "Чтобы импортировать весь основной набор функциональных возможностей",
    "PATCHING": "Импортировать только то, что вам нужно, путем исправления (это полезно для сортировки с учетом размера)",
    "WITHBIND": "Импортировать то, что вам нужно, и использовать его с <a href=\"#/operators\">bind оператор</a>:",
    "NOTE": "Примечание. Этот дополнительный синтаксис требует поддержки транспилеров, и этот синтаксис может быть полностью исключен из TC39 без уведомления! Используйте на свой риск.",
    "ERROR": "Если вы получили сообщение об ошибке <code class=\"inline\">error TS2304: Cannot find name 'Promise' or error TS2304: Cannot find name 'Iterable'</code> при использовании RxJS вам может потребоваться установить дополнительный набор титров.",
    "TYPINGUSERS": "Для <span class=\"accent\">typings</span> пользователи:",
    "NOTINTERFACE": "Если вы не используете типизацию, интерфейсы могут быть скопированы из <span class=\"accent\">/es6-shim/es6-shim.d.ts.</span>",
    "ADDTYPE": "Добавить файл определения типа, включенный в <code class=\"inline\">tsconfig.json</code> или CLI argument.",
    "ALLMODULETYPES": "Все типы модулей",
    "VIAV3": "Чтобы установить эту библиотеку через версию npm версии 3, используйте следующую команду",
    "VIAV2": "Если вы используете версию npm версии 2 до того, как эта библиотека достигнет стабильной версии, вам необходимо явно указать версию библиотеки",
    "FORCDN": {
      "PART1": "Для CDN вы можете использовать.",
      "PART2": "Просто замените версию текущей версией на ссылку ниже"
    },
    "FORBETA1": "Для RxJS 5.0.0-beta.1 through beta.11",
    "FORBETA12": "Для RxJS 5.0.0-beta.12 and higher",
    "ADDITIONALRESOURCES": "Дополнительные ресурсы",
    "OPERATORS": "операторы"
  }
}
